package myButik.projeсt;

import java.util.Arrays;
import java.util.List;

public class Advertisement {
    public final static List<String> nostalgiskSortiment = Arrays.asList(
            "**************************************************************",
            "Товары из набора \"Ностальжи\"\nВсегда в продаже! Всё по одной цене!\nЗа единицу товара один советский олимпийский рубль!\nВыбор за вами!",
            "--------------------------------------------------------------",
            "ГОВЯДИНА ТУШЁНАЯ",
            "СВИНИНА ТУШЁНАЯ",
            "БАРАНИНА ТУШЁНАЯ",
            "ХЛЕБ РЖАНОЙ",
            "ИКРА КАБАЧКОВАЯ",
            "ИКРА ЧЁРНАЯ",
            "ИКРА КРАСНАЯ",
            "ИКРА МИНТАЯ",
            "ПЕЧЕНЬ ТРЕСКИ",
            "ИКРА ЗАМОРСКАЯ БАКЛАЖАННАЯ",
            "КОЛБАСА \"ЛЮБИТЕЛЬСКАЯ\"",
            "ВОДКА \"ПОСОЛЬСКАЯ\"",
            "\"ЗУБРОВКА\"",
            "ПИВО \"ЖИГУЛЁВСКОЕ\"",
            "СЕЛЬДЬ ПРЯНОГО ПОСОЛА",
            "КИЛЬКА В ТОМАТНОМ СОУСЕ",
            "СЫР ПЛАВЛЕНЫЙ \"ДРУЖБА\"",
            "ПАПИРОСЫ \"КАЗБЕК\"",
            "ПАПИРОСЫ \"БЕЛОМОРКАНАЛ\"",
            "СИГАРЕТЫ \"ПАМИР\"",
            "**************************************************************"
    );

    public void constAssortment() {

        for (String s : nostalgiskSortiment) {
            System.out.println(s);
        }
        QuestionAndAnswer.questionAndAnswer("Желаете приобрести?", "Свяжитесь с нами по телефону 222-22...", "А зря...");
    }
}
